prof_repo/Hull_Design/TD3_Voilier/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type        calculated;
        value       uniform 0;
    }

    outlet
    {
        type        calculated;
        value       uniform 0;
    }

    atmosphere
    {
        type        calculated;
        value       uniform 0;
    }

    Carena
    {
        // Paroi rugueuse ITTC : Ks = 150e-6 m (acier commercial neuf)
        type        nutkRoughWallFunction;
        Ks          uniform 150e-6;
        Cs          uniform 0.5;
        value       uniform 0;
    }

    sides
    {
        type        calculated;
        value       uniform 0;
    }
}

// ************************************************************************* //
