prof_repo/Hull_Design/TD3_Voilier/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// p_rgh = p - rho*g*h  (pression hydrostatique soustraite)

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type        fixedFluxPressure;
        value       uniform 0;
    }

    outlet
    {
        type        zeroGradient;
    }

    atmosphere
    {
        // Pression totale nulle à la surface libre
        type        totalPressure;
        p0          uniform 0;
        value       uniform 0;
    }

    Carena
    {
        type        fixedFluxPressure;
        value       uniform 0;
    }

    sides
    {
        type        fixedFluxPressure;
        value       uniform 0;
    }
}

// ************************************************************************* //
