prof_repo/Hull_Design/TD3_Voilier/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet       { type fixedValue; value uniform (0 0 0); }
    outlet      { type fixedValue; value uniform (0 0 0); }
    atmosphere  { type fixedValue; value uniform (0 0 0); }
    sides       { type fixedValue; value uniform (0 0 0); }

    // La carène est libre de se déplacer (géré par rigidBodyMotion)
    Carena
    {
        type        calculated;
        value       uniform (0 0 0);
    }
}

// ************************************************************************* //
