prof_repo/Hull_Design/TD3_Voilier/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "initialConditions"

scale   1;

vertices
(
    ( $L1  $B1  $D1 )   // 0
    ( $L2  $B1  $D1 )   // 1
    ( $L2  $B2  $D1 )   // 2
    ( $L1  $B2  $D1 )   // 3
    ( $L1  $B1  $D2 )   // 4
    ( $L2  $B1  $D2 )   // 5
    ( $L2  $B2  $D2 )   // 6
    ( $L1  $B2  $D2 )   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    ( $Nx $Ny $Nz )
    simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type    patch;
        faces   ( (0 3 7 4) );
    }

    outlet
    {
        type    patch;
        faces   ( (1 2 6 5) );
    }

    atmosphere
    {
        type    patch;
        faces   ( (4 5 6 7) );   // z=D2 — surface supérieure
    }

    sides
    {
        type    patch;
        faces
        (
            (0 1 5 4)   // y=B1 — côté bâbord lointain
            (3 2 6 7)   // y=B2 — côté tribord lointain
            (0 1 2 3)   // z=D1 — fond du domaine
        );
    }
);

// ************************************************************************* //
