prof_repo/Hull_Design/TD3_Voilier/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(U)         cellLimited Gauss linear 1;
    grad(alpha.water) Gauss linear;
}

divSchemes
{
    default                         none;
    div(rhoPhi,U)                   Gauss linearUpwind grad(U);
    div(phi,alpha.water)            Gauss vanLeer;
    div(phi,alpha)                  Gauss vanLeer;
    div(phirb,alpha.water)          Gauss linear;
    div(phirb,alpha)                Gauss linear;
    div(phi,k)                      Gauss upwind;
    div(phi,omega)                  Gauss upwind;
    div((nuEff*dev2(T(grad(U)))))           Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U)))))     Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
}

// ************************************************************************* //
