prof_repo/Hull_Design/TD3_Voilier/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Initialise alpha.water = 0 (air) partout, puis 1 (eau) sous z=0

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    // Remplir d'eau la demi-inférieure du domaine (z < 0)
    boxToCell
    {
        box (-1000 -1000 -1000) (1000 1000 0.0);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }

    // Note : boxToFace ne s'applique pas aux volScalarField — supprimé
);

// ************************************************************************* //
